
#### Terraform fmt check `success`
#### Terraform init `success`
#### Terraform validate `success`
#### Terraform plan `success`
<details>
  <summary>Show Plan</summary>
  
  ```
    module.root.google_service_account.github_actions_mysql_client: Refreshing state... [id=projects/company-official-app-dev/serviceAccounts/github-actions-mysql-client@company-official-app-dev.iam.gserviceaccount.com]
module.root.google_project_iam_custom_role.github_actions_read_only_role: Refreshing state... [id=projects/company-official-app-dev/roles/github_actions_read_only_role]
module.root.google_storage_bucket.manage_tfstate: Refreshing state... [id=tfstate-coa-dev]
module.root.google_compute_network.private_network: Refreshing state... [id=projects/company-official-app-dev/global/networks/private-network]
module.root.google_project_service.service_networking: Refreshing state... [id=company-official-app-dev/servicenetworking.googleapis.com]
module.root.google_project_service.iam: Refreshing state... [id=company-official-app-dev/iam.googleapis.com]
module.root.google_project_service.cloud_sql_admin: Refreshing state... [id=company-official-app-dev/sqladmin.googleapis.com]
module.root.google_project_service.service_usage: Refreshing state... [id=company-official-app-dev/serviceusage.googleapis.com]
module.root.google_project_service.resource_manager: Refreshing state... [id=company-official-app-dev/cloudresourcemanager.googleapis.com]
module.root.google_service_account.github_actions_read_write_service_account: Refreshing state... [id=projects/company-official-app-dev/serviceAccounts/github-actions-read-write@company-official-app-dev.iam.gserviceaccount.com]
module.root.google_project_iam_custom_role.github_actions_read_write_role: Refreshing state... [id=projects/company-official-app-dev/roles/github_actions_read_write_role]
module.root.google_service_account.github_actions_read_only_service_account: Refreshing state... [id=projects/company-official-app-dev/serviceAccounts/github-actions-read-only@company-official-app-dev.iam.gserviceaccount.com]
module.root.google_project_iam_member.github_actions_mysql_client: Refreshing state... [id=company-official-app-dev/roles/cloudsql.client/serviceAccount:github-actions-mysql-client@company-official-app-dev.iam.gserviceaccount.com]
module.root.google_compute_global_address.private_ip_address: Refreshing state... [id=projects/company-official-app-dev/global/addresses/private-ip-address]
module.root.google_project_iam_member.github_actions_read_only_iam: Refreshing state... [id=company-official-app-dev/projects/company-official-app-dev/roles/github_actions_read_only_role/serviceAccount:github-actions-read-only@company-official-app-dev.iam.gserviceaccount.com]
module.root.google_project_iam_member.github_actions_read_write_iam: Refreshing state... [id=company-official-app-dev/projects/company-official-app-dev/roles/github_actions_read_write_role/serviceAccount:github-actions-read-write@company-official-app-dev.iam.gserviceaccount.com]
module.root.google_service_networking_connection.private_connection: Refreshing state... [id=projects%2Fcompany-official-app-dev%2Fglobal%2Fnetworks%2Fprivate-network:servicenetworking.googleapis.com]
google_sql_database_instance.app_mysql_instance: Refreshing state... [id=app-mysql-01]
module.root.google_sql_user.app_mysql_root_user: Refreshing state... [id=root//app-mysql-01]
module.root.google_sql_user.app_mysql_user: Refreshing state... [id=app//app-mysql-01]
module.root.google_sql_database.app_mysql_database: Refreshing state... [id=projects/company-official-app-dev/instances/app-mysql-01/databases/app-mysql-database]
module.root.google_sql_user.app_mysql_migration_ro_user: Refreshing state... [id=migration_ro//app-mysql-01]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.root.google_cloud_run_service.company_official_app_backend will be created
  + resource "google_cloud_run_service" "company_official_app_backend" {
      + autogenerate_revision_name = true
      + id                         = (known after apply)
      + location                   = "asia-northeast1"
      + name                       = "company-official-app-backend-dev"
      + project                    = "company-official-app-dev"
      + status                     = (known after apply)

      + metadata {
          + annotations      = {
              + "run.googleapis.com/ingress"      = "all"
              + "run.googleapis.com/launch-stage" = "BETA"
            }
          + generation       = (known after apply)
          + labels           = (known after apply)
          + namespace        = (known after apply)
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + template {
          + metadata {
              + annotations      = {
                  + "autoscaling.knative.dev/maxScale"      = "10"
                  + "autoscaling.knative.dev/minScale"      = "0"
                  + "run.googleapis.com/cloudsql-instances" = "company-official-app-dev:asia-northeast1:app-mysql-01"
                }
              + generation       = (known after apply)
              + name             = (known after apply)
              + namespace        = (known after apply)
              + resource_version = (known after apply)
              + self_link        = (known after apply)
              + uid              = (known after apply)
            }

          + spec {
              + container_concurrency = (known after apply)
              + service_account_name  = (known after apply)
              + serving_state         = (known after apply)
              + timeout_seconds       = (known after apply)

              + containers {
                  + image = "asia.gcr.io/company-official-app-dev/company-official-app-backend:latest"

                  + env {
                      + name  = "DB_SOCKET_PATH"
                      + value = "/cloudsql/company-official-app-dev:asia-northeast1:app-mysql-01"
                    }
                  + env {
                      + name  = "MYSQL_DATABASE"
                      + value = "app-mysql-database"
                    }
                  + env {
                      + name = "MYSQL_PASSWORD"

                      + value_from {
                          + secret_key_ref {
                              + key  = "latest"
                              + name = "mysql_password"
                            }
                        }
                    }
                  + env {
                      + name  = "MYSQL_USER"
                      + value = "app"
                    }

                  + ports {
                      + container_port = (known after apply)
                      + name           = (known after apply)
                      + protocol       = (known after apply)
                    }

                  + resources {
                      + limits   = (known after apply)
                      + requests = (known after apply)
                    }
                }
            }
        }

      + traffic {
          + latest_revision = true
          + percent         = 100
        }
    }

  # module.root.google_cloud_run_service_iam_member.backend_api_noauth will be created
  + resource "google_cloud_run_service_iam_member" "backend_api_noauth" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + location = "asia-northeast1"
      + member   = "allUsers"
      + project  = "company-official-app-dev"
      + role     = "roles/run.invoker"
      + service  = "company-official-app-backend-dev"
    }

  # module.root.google_project_iam_custom_role.backend_api will be created
  + resource "google_project_iam_custom_role" "backend_api" {
      + deleted     = (known after apply)
      + description = "Cloud Runサービスであるbackend-apiがGCPのリソースへアクセスする用"
      + id          = (known after apply)
      + name        = (known after apply)
      + permissions = [
          + "cloudsql.instances.connect",
          + "cloudsql.instances.get",
          + "iam.serviceAccounts.actAs",
          + "iam.serviceAccounts.get",
          + "iam.serviceAccounts.list",
          + "resourcemanager.projects.get",
          + "secretmanager.versions.access",
        ]
      + project     = (known after apply)
      + role_id     = "backend_api_role"
      + stage       = "GA"
      + title       = "Backend API Role to Access GCP Resource"
    }

  # module.root.google_project_iam_member.backend_api will be created
  + resource "google_project_iam_member" "backend_api" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "company-official-app-dev"
      + role    = "projects/company-official-app-dev/roles/backend_api_role"
    }

  # module.root.google_project_service.cloud_run will be created
  + resource "google_project_service" "cloud_run" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "company-official-app-dev"
      + service                    = "run.googleapis.com"
    }

  # module.root.google_project_service.secret_manager will be created
  + resource "google_project_service" "secret_manager" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "company-official-app-dev"
      + service                    = "secretmanager.googleapis.com"
    }

  # module.root.google_service_account.backend_api will be created
  + resource "google_service_account" "backend_api" {
      + account_id   = "backend-api"
      + description  = "Cloud Runサービスであるbackend-apiがGCPのリソースへアクセスする用"
      + display_name = "backend-api"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

Plan: 7 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

    
  ```

</details>